In [1]:
import pandas as pd
l = [5, 35, 4, 6, 2, 1, 1, -20, 5, 2, 5, 9, 7]
df = pd.DataFrame(l)
df

     0
0    5
1   35
2    4
3    6
4    2
5    1
6    1
7  -20
8    5
9    2
10   5
11   9
12   7

In [2]:
Q1 = df.quantile(0.25).sum()
Q3 = df.quantile(0.75).sum()
IQR = Q3-Q1
IQR

4.0

In [4]:
df.loc[((df[0] < Q1) & (df[0] < 3 * IQR)) | ((df[0] > Q3) & (df[0] > 3 * IQR))]

    0
1  35
5   1
6   1
7 -20